package homework_08;

import java.util.Scanner;

//Task 3 Дан массив целых чисел. *Выберите произвольную длину. Заполните случайными значениями.
//Вывести на экран:
//минимальное значение, хранящееся в массиве
//максимальное
//среднее арифметическое всех значений в массиве
public class Task_03 {
    public static void main(String[] args) {
        int[] numbers = new int[] {1, 2, 3, 4, 5, 6, 7, 8, 9};
        String[] strings = {"One", "Two", "Three", "For", "Five" };
        Scanner scanner = new Scanner(System.in);
        System.out.println("Выводим на экран: "+ numbers);





    }


}
